In [1]:
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
df=pd.read_excel("GAME.xlsx")

In [3]:
df

       platform  Genre  Publisher  NA_Sales
0             1      1          1     41.49
1             2      2          1     29.08
2             1      3          1     15.85
3             1      1          1     15.75
4             3      4          1     11.27
...         ...    ...        ...       ...
16592         9      2        542      0.01
16593        18      7        552      0.01
16594         7      3          5      0.00
16595         4      5         46      0.00
16596         9      2         79      0.01

[16597 rows x 4 columns]

In [4]:
df=df.values

In [5]:
df

array([[1.000e+00, 1.000e+00, 1.000e+00, 4.149e+01],
       [2.000e+00, 2.000e+00, 1.000e+00, 2.908e+01],
       [1.000e+00, 3.000e+00, 1.000e+00, 1.585e+01],
       ...,
       [7.000e+00, 3.000e+00, 5.000e+00, 0.000e+00],
       [4.000e+00, 5.000e+00, 4.600e+01, 0.000e+00],
       [9.000e+00, 2.000e+00, 7.900e+01, 1.000e-02]])

In [8]:
df2=pd.read_excel("y.xlsx")

In [9]:
df2

       Global_Sales
0             82.74
1             40.24
2             35.82
3             33.00
4             31.37
...             ...
16592          0.01
16593          0.01
16594          0.01
16595          0.01
16596          0.01

[16597 rows x 1 columns]

In [10]:
df2=df2.values

In [11]:
df2

array([[8.274e+01],
       [4.024e+01],
       [3.582e+01],
       ...,
       [1.000e-02],
       [1.000e-02],
       [1.000e-02]])